# Titanic - Machine Learning from Disaster

### Import packages and modules

In [275]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
#  Magic function from IPython that renders figures in a notebook
# instead of displaying a dump of the figure objects
%matplotlib inline
import seaborn as sns

from sklearn.preprocessing import OrdinalEncoder, OneHotEncoder

from sklearn.impute import SimpleImputer

from sklearn.compose import make_column_transformer
from sklearn.pipeline import  Pipeline, make_pipeline

from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB

from sklearn.model_selection import cross_val_score, StratifiedKFold, train_test_split, GridSearchCV

### Load datasets

In [276]:
train_df = pd.read_csv('input/train.csv')
test_df = pd.read_csv('input/test.csv')
# Use paths
# '/kaggle/input/titanic/train.csv'
# '/kaggle/input/titanic/test.csv'
# when using Kaggle notebook

### Dataset explanation

In [277]:
# COLUMN NAME       DEFINITION              KEY
# Survived          Survival                0 = No, 1 = Yes
# Pclass            Ticket class            1 = 1st, 2 = 2nd, 3 = 3rd
# Sex               Sex
# Age               Age in years
# SibSp             Num of siblings/spouses
#                   aboard with passenger
# Parch             Num of parents/children
#                   aboard with passenger
# Ticket            Ticket number   
# Fare              Passenger fare
# Cabin             Cabin number
# Embarked          Port of embarkation     C = Cherbourg, Q = Queenstown, S = Southampton

### Explore datasets

In [278]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [279]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [280]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [281]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [282]:
train_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [283]:
test_df.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [284]:
train_df.describe(include=['O'])

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [285]:
test_df.describe(include=['O'])

                    Name   Sex    Ticket            Cabin Embarked
count                418   418       418               91      418
unique               418     2       363               76        3
top     Kelly, Mr. James  male  PC 17608  B57 B59 B63 B66        S
freq                   1   266         5                3      270

In [286]:
# Group by 'Pclass' and show 'Survived' means,
# i.e., show 'Survived' means for all unique 'Pclass' values
train_df.groupby(['Pclass'], as_index=False)['Survived'].mean()
# The higher passenger's class was, the more likely they were to survive

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [287]:
train_df.groupby(['Sex'], as_index=False)['Survived'].mean()
# Females were much more likely to survive than males

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [288]:
train_df.groupby(['SibSp'], as_index=False)['Survived'].mean()
# You had best chances of survival if you had a total of one sibling/spouse on board with you

   SibSp  Survived
0      0  0.345395
1      1  0.535885
2      2  0.464286
3      3  0.250000
4      4  0.166667
5      5  0.000000
6      8  0.000000

In [289]:
train_df.groupby(['Parch'], as_index=False)['Survived'].mean()
# You had best chances of survival if you had a total of three parents/children on board with you

   Parch  Survived
0      0  0.343658
1      1  0.550847
2      2  0.500000
3      3  0.600000
4      4  0.000000
5      5  0.200000
6      6  0.000000

In [290]:
# Create a new column 'Family_Size' for both datasets
train_df['Family_Size'] = train_df['SibSp'] + train_df['Parch'] + 1
test_df['Family_Size'] = test_df['SibSp'] + test_df['Parch'] + 1

In [291]:
train_df.groupby(['Family_Size'], as_index=False)['Survived'].mean()
# You had best chances of survival if you were traveling with a family of four

   Family_Size  Survived
0            1  0.303538
1            2  0.552795
2            3  0.578431
3            4  0.724138
4            5  0.200000
5            6  0.136364
6            7  0.333333
7            8  0.000000
8           11  0.000000

In [292]:
# Create a dictionary with descriptions for family sizes
family_map = {1: 'Alone', 2: 'Small', 3: 'Small', 4: 'Small', 5: 'Medium', 6: 'Medium', 7: 'Large', 8: 'Large', 11: 'Large'}
# Apply the dictionary to every element in 'Family_Size'
train_df['Family_Size_Grouped'] = train_df['Family_Size'].map(family_map)
test_df['Family_Size_Grouped'] = train_df['Family_Size'].map(family_map)

train_df['Family_Size_Grouped']
# Now the old numerical values are replaced with the descriptions

0      Small
1      Small
2      Alone
3      Small
4      Alone
       ...
886    Alone
887    Alone
888    Small
889    Alone
890    Alone
Name: Family_Size_Grouped, Length: 891, dtype: object

In [293]:
train_df.groupby(['Family_Size_Grouped'], as_index=False)['Survived'].mean()
# Here's the family size's effect to survival rates again, but with the descriptions

  Family_Size_Grouped  Survived
0               Alone  0.303538
1               Large  0.160000
2              Medium  0.162162
3               Small  0.578767

In [294]:
train_df.groupby(['Embarked'], as_index=False)['Survived'].mean()
# You had best chances of survival if you embarked from Cherbourg, least if from Southampton

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.336957